DanielRossi1/ToF-Thermal-Cam-Array/sensor_array_idf/sdkconfig.defaults
# ── Target & flash (unchanged, keep yours) ───────────────────────────────────
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ── PSRAM (unchanged, keep yours) ────────────────────────────────────────────
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# ── USB OTG (your flag + critical additions) ──────────────────────────────────
CONFIG_USB_OTG_SUPPORTED=y

# CHANGE: was FIFO_BIAS_IN — bias toward RX for isochronous IN endpoints.
# FIFO_BIAS_IN gives more FIFO space to the IN (camera→host) direction.
# Keep this — it's correct for a camera. But add the two lines below it.
CONFIG_USB_OTG_FIFO_BIAS_IN=y

# ADD: raise the internal DMA/FIFO transfer ceiling.
# Default is 256 bytes — far too small for a 1536-byte isochronous packet.
# Must be ≥ ep_mps (1536). Use 2048 for headroom.
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=2048

# ADD: number of simultaneous isochronous transfers in flight.
# usb_stream double-buffers by default; 4 gives smoother delivery under load.
CONFIG_USB_HOST_HCD_EVENT_QUEUE_SIZE=16

# ── Serial / JTAG (unchanged, keep yours) ────────────────────────────────────
CONFIG_USJ_ENABLE_USB_SERIAL_JTAG=n
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESPTOOLPY_MONITOR_BAUD=2000000

# ── FreeRTOS (unchanged, 1 kHz tick is correct) ──────────────────────────────
CONFIG_FREERTOS_HZ=1000

# ── Tasks & stack ────────────────────────────────────────────────────────────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# ADD: usb_stream spins its own internal task. Give it enough stack.
# Default (2048) overflows when the UVC callback chain is deep.
CONFIG_USB_STREAM_TASK_STACK_SIZE=4096

# ADD: pin the USB host task to Core 0 so it doesn't compete with your
# loop_task on Core 1. usb_stream respects this config if present.
CONFIG_USB_STREAM_TASK_CORE=0
CONFIG_USB_STREAM_TASK_PRIORITY=5

# ── Bluetooth (unchanged) ─────────────────────────────────────────────────────
CONFIG_BT_ENABLED=n

# ── Memory / cache ────────────────────────────────────────────────────────────
# ADD: cache line write-back is required when DMA buffers (xfer_a_, xfer_b_)
# are in internal RAM and PSRAM is also active. Without this, the CPU cache
# and DMA see different views of the transfer buffers and you get corrupt frames.
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# ADD: enable memory poison detection in debug builds to catch buffer overruns
# in the UVC frame path early. Disable in production if you need the speed.
# CONFIG_HEAP_POISONING_COMPREHENSIVE=y   ← uncomment for debug only